{"format": "layers-model", "generatedBy": "keras v2.2.4", "convertedBy": "TensorFlow.js Converter v3.9.0", "modelTopology": {"keras_version": "2.2.4", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"sparse": false, "batch_input_shape": [null, 224, 224, 3], "name": "input_1", "dtype": "float32"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": false, "name": "conv1_pad", "data_format": "channels_last"}, "name": "conv1_pad", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": false, "dilation_rate": [1, 1], "strides": [2, 2], "kernel_constraint": null, "filters": 24, "name": "conv1", "bias_constraint": null, "kernel_regularizer": null, "trainable": false, "activity_regularizer": null, "bias_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last"}, "name": "conv1", "inbound_nodes": [[["conv1_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv1_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "scale": true, "trainable": false, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "axis": -1, "gamma_constraint": null}, "name": "conv1_bn", "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"max_value": 6.0, "negative_slope": 0.0, "trainable": false, "name": "conv1_relu", "threshold": 0.0}, "name": "conv1_relu", "inbound_nodes": [[["conv1_bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"activation": "linear", "kernel_size": [3, 3], "use_bias": false, "dilation_rate": [1, 1], "depthwise_constraint": null, "strides": [1, 1], "depth_multiplier": 1, "name": "conv_dw_1", "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": false, "depthwise_regularizer": null, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_dw_1", "inbound_nodes": [[["conv1_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv_dw_1_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "scale": true, "trainable": false, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "axis": -1, "gamma_constraint": null}, "name": "conv_dw_1_bn", "inbound_nodes": [[["conv_dw_1", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"max_value": 6.0, "negative_slope": 0.0, "trainable": false, "name": "conv_dw_1_relu", "threshold": 0.0}, "name": "conv_dw_1_relu", "inbound_nodes": [[["conv_dw_1_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": false, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_constraint": null, "filters": 48, "name": "conv_pw_1", "bias_constraint": null, "kernel_regularizer": null, "trainable": false, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last"}, "name": "conv_pw_1", "inbound_nodes": [[["conv_dw_1_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv_pw_1_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "scale": true, "trainable": false, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "axis": -1, "gamma_constraint": null}, "name": "conv_pw_1_bn", "inbound_nodes": [[["conv_pw_1", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"max_value": 6.0, "negative_slope": 0.0, "trainable": false, "name": "conv_pw_1_relu", "threshold": 0.0}, "name": "conv_pw_1_relu", "inbound_nodes": [[["conv_pw_1_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": false, "name": "conv_pad_2", "data_format": "channels_last"}, "name": "conv_pad_2", "inbound_nodes": [[["conv_pw_1_relu", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"activation": "linear", "kernel_size": [3, 3], "use_bias": false, "dilation_rate": [1, 1], "depthwise_constraint": null, "strides": [2, 2], "depth_multiplier": 1, "name": "conv_dw_2", "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": false, "depthwise_regularizer": null, "padding": "valid", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_dw_2", "inbound_nodes": [[["conv_pad_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv_dw_2_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "scale": true, "trainable": false, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "axis": -1, "gamma_constraint": null}, "name": "conv_dw_2_bn", "inbound_nodes": [[["conv_dw_2", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"max_value": 6.0, "negative_slope": 0.0, "trainable": false, "name": "conv_dw_2_relu", "threshold": 0.0}, "name": "conv_dw_2_relu", "inbound_nodes": [[["conv_dw_2_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": false, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_constraint": null, "filters": 96, "name": "conv_pw_2", "bias_constraint": null, "kernel_regularizer": null, "trainable": false, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last"}, "name": "conv_pw_2", "inbound_nodes": [[["conv_dw_2_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv_pw_2_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "scale": true, "trainable": false, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "axis": -1, "gamma_constraint": null}, "name": "conv_pw_2_bn", "inbound_nodes": [[["conv_pw_2", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"max_value": 6.0, "negative_slope": 0.0, "trainable": false, "name": "conv_pw_2_relu", "threshold": 0.0}, "name": "conv_pw_2_relu", "inbound_nodes": [[["conv_pw_2_bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"activation": "linear", "kernel_size": [3, 3], "use_bias": false, "dilation_rate": [1, 1], "depthwise_constraint": null, "strides": [1, 1], "depth_multiplier": 1, "name": "conv_dw_3", "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": false, "depthwise_regularizer": null, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_dw_3", "inbound_nodes": [[["conv_pw_2_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv_dw_3_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "scale": true, "trainable": false, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "axis": -1, "gamma_constraint": null}, "name": "conv_dw_3_bn", "inbound_nodes": [[["conv_dw_3", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"max_value": 6.0, "negative_slope": 0.0, "trainable": false, "name": "conv_dw_3_relu", "threshold": 0.0}, "name": "conv_dw_3_relu", "inbound_nodes": [[["conv_dw_3_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": false, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_constraint": null, "filters": 96, "name": "conv_pw_3", "bias_constraint": null, "kernel_regularizer": null, "trainable": false, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last"}, "name": "conv_pw_3", "inbound_nodes": [[["conv_dw_3_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv_pw_3_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "scale": true, "trainable": false, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "axis": -1, "gamma_constraint": null}, "name": "conv_pw_3_bn", "inbound_nodes": [[["conv_pw_3", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"max_value": 6.0, "negative_slope": 0.0, "trainable": false, "name": "conv_pw_3_relu", "threshold": 0.0}, "name": "conv_pw_3_relu", "inbound_nodes": [[["conv_pw_3_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": false, "name": "conv_pad_4", "data_format": "channels_last"}, "name": "conv_pad_4", "inbound_nodes": [[["conv_pw_3_relu", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"activation": "linear", "kernel_size": [3, 3], "use_bias": false, "dilation_rate": [1, 1], "depthwise_constraint": null, "strides": [2, 2], "depth_multiplier": 1, "name": "conv_dw_4", "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": false, "depthwise_regularizer": null, "padding": "valid", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_dw_4", "inbound_nodes": [[["conv_pad_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv_dw_4_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "scale": true, "trainable": false, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "axis": -1, "gamma_constraint": null}, "name": "conv_dw_4_bn", "inbound_nodes": [[["conv_dw_4", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"max_value": 6.0, "negative_slope": 0.0, "trainable": false, "name": "conv_dw_4_relu", "threshold": 0.0}, "name": "conv_dw_4_relu", "inbound_nodes": [[["conv_dw_4_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": false, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_constraint": null, "filters": 192, "name": "conv_pw_4", "bias_constraint": null, "kernel_regularizer": null, "trainable": false, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last"}, "name": "conv_pw_4", "inbound_nodes": [[["conv_dw_4_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv_pw_4_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "scale": true, "trainable": false, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "axis": -1, "gamma_constraint": null}, "name": "conv_pw_4_bn", "inbound_nodes": [[["conv_pw_4", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"max_value": 6.0, "negative_slope": 0.0, "trainable": false, "name": "conv_pw_4_relu", "threshold": 0.0}, "name": "conv_pw_4_relu", "inbound_nodes": [[["conv_pw_4_bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"activation": "linear", "kernel_size": [3, 3], "use_bias": false, "dilation_rate": [1, 1], "depthwise_constraint": null, "strides": [1, 1], "depth_multiplier": 1, "name": "conv_dw_5", "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": false, "depthwise_regularizer": null, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_dw_5", "inbound_nodes": [[["conv_pw_4_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv_dw_5_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "scale": true, "trainable": false, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "axis": -1, "gamma_constraint": null}, "name": "conv_dw_5_bn", "inbound_nodes": [[["conv_dw_5", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"max_value": 6.0, "negative_slope": 0.0, "trainable": false, "name": "conv_dw_5_relu", "threshold": 0.0}, "name": "conv_dw_5_relu", "inbound_nodes": [[["conv_dw_5_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": false, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_constraint": null, "filters": 192, "name": "conv_pw_5", "bias_constraint": null, "kernel_regularizer": null, "trainable": false, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last"}, "name": "conv_pw_5", "inbound_nodes": [[["conv_dw_5_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv_pw_5_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "scale": true, "trainable": false, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "axis": -1, "gamma_constraint": null}, "name": "conv_pw_5_bn", "inbound_nodes": [[["conv_pw_5", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"max_value": 6.0, "negative_slope": 0.0, "trainable": false, "name": "conv_pw_5_relu", "threshold": 0.0}, "name": "conv_pw_5_relu", "inbound_nodes": [[["conv_pw_5_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": false, "name": "conv_pad_6", "data_format": "channels_last"}, "name": "conv_pad_6", "inbound_nodes": [[["conv_pw_5_relu", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"activation": "linear", "kernel_size": [3, 3], "use_bias": false, "dilation_rate": [1, 1], "depthwise_constraint": null, "strides": [2, 2], "depth_multiplier": 1, "name": "conv_dw_6", "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": false, "depthwise_regularizer": null, "padding": "valid", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_dw_6", "inbound_nodes": [[["conv_pad_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv_dw_6_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "scale": true, "trainable": false, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "axis": -1, "gamma_constraint": null}, "name": "conv_dw_6_bn", "inbound_nodes": [[["conv_dw_6", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"max_value": 6.0, "negative_slope": 0.0, "trainable": false, "name": "conv_dw_6_relu", "threshold": 0.0}, "name": "conv_dw_6_relu", "inbound_nodes": [[["conv_dw_6_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": false, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_constraint": null, "filters": 384, "name": "conv_pw_6", "bias_constraint": null, "kernel_regularizer": null, "trainable": false, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last"}, "name": "conv_pw_6", "inbound_nodes": [[["conv_dw_6_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv_pw_6_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "scale": true, "trainable": false, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "axis": -1, "gamma_constraint": null}, "name": "conv_pw_6_bn", "inbound_nodes": [[["conv_pw_6", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"max_value": 6.0, "negative_slope": 0.0, "trainable": false, "name": "conv_pw_6_relu", "threshold": 0.0}, "name": "conv_pw_6_relu", "inbound_nodes": [[["conv_pw_6_bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"activation": "linear", "kernel_size": [3, 3], "use_bias": false, "dilation_rate": [1, 1], "depthwise_constraint": null, "strides": [1, 1], "depth_multiplier": 1, "name": "conv_dw_7", "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": false, "depthwise_regularizer": null, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_dw_7", "inbound_nodes": [[["conv_pw_6_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv_dw_7_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "scale": true, "trainable": false, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "axis": -1, "gamma_constraint": null}, "name": "conv_dw_7_bn", "inbound_nodes": [[["conv_dw_7", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"max_value": 6.0, "negative_slope": 0.0, "trainable": false, "name": "conv_dw_7_relu", "threshold": 0.0}, "name": "conv_dw_7_relu", "inbound_nodes": [[["conv_dw_7_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": false, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_constraint": null, "filters": 384, "name": "conv_pw_7", "bias_constraint": null, "kernel_regularizer": null, "trainable": false, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last"}, "name": "conv_pw_7", "inbound_nodes": [[["conv_dw_7_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv_pw_7_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "scale": true, "trainable": false, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "axis": -1, "gamma_constraint": null}, "name": "conv_pw_7_bn", "inbound_nodes": [[["conv_pw_7", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"max_value": 6.0, "negative_slope": 0.0, "trainable": false, "name": "conv_pw_7_relu", "threshold": 0.0}, "name": "conv_pw_7_relu", "inbound_nodes": [[["conv_pw_7_bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"activation": "linear", "kernel_size": [3, 3], "use_bias": false, "dilation_rate": [1, 1], "depthwise_constraint": null, "strides": [1, 1], "depth_multiplier": 1, "name": "conv_dw_8", "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": false, "depthwise_regularizer": null, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_dw_8", "inbound_nodes": [[["conv_pw_7_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv_dw_8_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "scale": true, "trainable": false, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "axis": -1, "gamma_constraint": null}, "name": "conv_dw_8_bn", "inbound_nodes": [[["conv_dw_8", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"max_value": 6.0, "negative_slope": 0.0, "trainable": false, "name": "conv_dw_8_relu", "threshold": 0.0}, "name": "conv_dw_8_relu", "inbound_nodes": [[["conv_dw_8_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": false, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_constraint": null, "filters": 384, "name": "conv_pw_8", "bias_constraint": null, "kernel_regularizer": null, "trainable": false, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last"}, "name": "conv_pw_8", "inbound_nodes": [[["conv_dw_8_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv_pw_8_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "scale": true, "trainable": false, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "axis": -1, "gamma_constraint": null}, "name": "conv_pw_8_bn", "inbound_nodes": [[["conv_pw_8", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"max_value": 6.0, "negative_slope": 0.0, "trainable": false, "name": "conv_pw_8_relu", "threshold": 0.0}, "name": "conv_pw_8_relu", "inbound_nodes": [[["conv_pw_8_bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"activation": "linear", "kernel_size": [3, 3], "use_bias": false, "dilation_rate": [1, 1], "depthwise_constraint": null, "strides": [1, 1], "depth_multiplier": 1, "name": "conv_dw_9", "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": false, "depthwise_regularizer": null, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_dw_9", "inbound_nodes": [[["conv_pw_8_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv_dw_9_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "scale": true, "trainable": false, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "axis": -1, "gamma_constraint": null}, "name": "conv_dw_9_bn", "inbound_nodes": [[["conv_dw_9", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"max_value": 6.0, "negative_slope": 0.0, "trainable": false, "name": "conv_dw_9_relu", "threshold": 0.0}, "name": "conv_dw_9_relu", "inbound_nodes": [[["conv_dw_9_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": false, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_constraint": null, "filters": 384, "name": "conv_pw_9", "bias_constraint": null, "kernel_regularizer": null, "trainable": false, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last"}, "name": "conv_pw_9", "inbound_nodes": [[["conv_dw_9_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv_pw_9_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "scale": true, "trainable": false, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "axis": -1, "gamma_constraint": null}, "name": "conv_pw_9_bn", "inbound_nodes": [[["conv_pw_9", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"max_value": 6.0, "negative_slope": 0.0, "trainable": false, "name": "conv_pw_9_relu", "threshold": 0.0}, "name": "conv_pw_9_relu", "inbound_nodes": [[["conv_pw_9_bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"activation": "linear", "kernel_size": [3, 3], "use_bias": false, "dilation_rate": [1, 1], "depthwise_constraint": null, "strides": [1, 1], "depth_multiplier": 1, "name": "conv_dw_10", "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": false, "depthwise_regularizer": null, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_dw_10", "inbound_nodes": [[["conv_pw_9_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv_dw_10_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "scale": true, "trainable": false, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "axis": -1, "gamma_constraint": null}, "name": "conv_dw_10_bn", "inbound_nodes": [[["conv_dw_10", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"max_value": 6.0, "negative_slope": 0.0, "trainable": false, "name": "conv_dw_10_relu", "threshold": 0.0}, "name": "conv_dw_10_relu", "inbound_nodes": [[["conv_dw_10_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": false, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_constraint": null, "filters": 384, "name": "conv_pw_10", "bias_constraint": null, "kernel_regularizer": null, "trainable": false, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last"}, "name": "conv_pw_10", "inbound_nodes": [[["conv_dw_10_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv_pw_10_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "scale": true, "trainable": false, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "axis": -1, "gamma_constraint": null}, "name": "conv_pw_10_bn", "inbound_nodes": [[["conv_pw_10", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"max_value": 6.0, "negative_slope": 0.0, "trainable": false, "name": "conv_pw_10_relu", "threshold": 0.0}, "name": "conv_pw_10_relu", "inbound_nodes": [[["conv_pw_10_bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"activation": "linear", "kernel_size": [3, 3], "use_bias": false, "dilation_rate": [1, 1], "depthwise_constraint": null, "strides": [1, 1], "depth_multiplier": 1, "name": "conv_dw_11", "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": false, "depthwise_regularizer": null, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_dw_11", "inbound_nodes": [[["conv_pw_10_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv_dw_11_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "scale": true, "trainable": false, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "axis": -1, "gamma_constraint": null}, "name": "conv_dw_11_bn", "inbound_nodes": [[["conv_dw_11", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"max_value": 6.0, "negative_slope": 0.0, "trainable": false, "name": "conv_dw_11_relu", "threshold": 0.0}, "name": "conv_dw_11_relu", "inbound_nodes": [[["conv_dw_11_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": false, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_constraint": null, "filters": 384, "name": "conv_pw_11", "bias_constraint": null, "kernel_regularizer": null, "trainable": false, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last"}, "name": "conv_pw_11", "inbound_nodes": [[["conv_dw_11_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv_pw_11_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "scale": true, "trainable": false, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "axis": -1, "gamma_constraint": null}, "name": "conv_pw_11_bn", "inbound_nodes": [[["conv_pw_11", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"max_value": 6.0, "negative_slope": 0.0, "trainable": false, "name": "conv_pw_11_relu", "threshold": 0.0}, "name": "conv_pw_11_relu", "inbound_nodes": [[["conv_pw_11_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": false, "name": "conv_pad_12", "data_format": "channels_last"}, "name": "conv_pad_12", "inbound_nodes": [[["conv_pw_11_relu", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"activation": "linear", "kernel_size": [3, 3], "use_bias": false, "dilation_rate": [1, 1], "depthwise_constraint": null, "strides": [2, 2], "depth_multiplier": 1, "name": "conv_dw_12", "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": false, "depthwise_regularizer": null, "padding": "valid", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_dw_12", "inbound_nodes": [[["conv_pad_12", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv_dw_12_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "scale": true, "trainable": false, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "axis": -1, "gamma_constraint": null}, "name": "conv_dw_12_bn", "inbound_nodes": [[["conv_dw_12", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"max_value": 6.0, "negative_slope": 0.0, "trainable": false, "name": "conv_dw_12_relu", "threshold": 0.0}, "name": "conv_dw_12_relu", "inbound_nodes": [[["conv_dw_12_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": false, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_constraint": null, "filters": 768, "name": "conv_pw_12", "bias_constraint": null, "kernel_regularizer": null, "trainable": false, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last"}, "name": "conv_pw_12", "inbound_nodes": [[["conv_dw_12_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv_pw_12_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "scale": true, "trainable": false, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "axis": -1, "gamma_constraint": null}, "name": "conv_pw_12_bn", "inbound_nodes": [[["conv_pw_12", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"max_value": 6.0, "negative_slope": 0.0, "trainable": false, "name": "conv_pw_12_relu", "threshold": 0.0}, "name": "conv_pw_12_relu", "inbound_nodes": [[["conv_pw_12_bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"activation": "linear", "kernel_size": [3, 3], "use_bias": false, "dilation_rate": [1, 1], "depthwise_constraint": null, "strides": [1, 1], "depth_multiplier": 1, "name": "conv_dw_13", "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": false, "depthwise_regularizer": null, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv_dw_13", "inbound_nodes": [[["conv_pw_12_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv_dw_13_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "scale": true, "trainable": false, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "axis": -1, "gamma_constraint": null}, "name": "conv_dw_13_bn", "inbound_nodes": [[["conv_dw_13", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"max_value": 6.0, "negative_slope": 0.0, "trainable": false, "name": "conv_dw_13_relu", "threshold": 0.0}, "name": "conv_dw_13_relu", "inbound_nodes": [[["conv_dw_13_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": false, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_constraint": null, "filters": 768, "name": "conv_pw_13", "bias_constraint": null, "kernel_regularizer": null, "trainable": false, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last"}, "name": "conv_pw_13", "inbound_nodes": [[["conv_dw_13_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv_pw_13_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "scale": true, "trainable": false, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "axis": -1, "gamma_constraint": null}, "name": "conv_pw_13_bn", "inbound_nodes": [[["conv_pw_13", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"max_value": 6.0, "negative_slope": 0.0, "trainable": true, "name": "conv_pw_13_relu", "threshold": 0.0}, "name": "conv_pw_13_relu", "inbound_nodes": [[["conv_pw_13_bn", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"trainable": true, "name": "global_average_pooling2d_1", "data_format": "channels_last"}, "name": "global_average_pooling2d_1", "inbound_nodes": [[["conv_pw_13_relu", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"rate": 0.001, "noise_shape": null, "trainable": true, "name": "dropout", "seed": null}, "name": "dropout", "inbound_nodes": [[["global_average_pooling2d_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"activation": "softmax", "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "units": 1000, "name": "dense_1", "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "dense_1", "inbound_nodes": [[["dropout", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["dense_1", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of3.bin", "group1-shard2of3.bin", "group1-shard3of3.bin"], "weights": [{"name": "conv1/kernel", "shape": [3, 3, 3, 24], "dtype": "float32"}, {"name": "conv1_bn/gamma", "shape": [24], "dtype": "float32"}, {"name": "conv1_bn/beta", "shape": [24], "dtype": "float32"}, {"name": "conv1_bn/moving_mean", "shape": [24], "dtype": "float32"}, {"name": "conv1_bn/moving_variance", "shape": [24], "dtype": "float32"}, {"name": "conv_dw_1/depthwise_kernel", "shape": [3, 3, 24, 1], "dtype": "float32"}, {"name": "conv_dw_10/depthwise_kernel", "shape": [3, 3, 384, 1], "dtype": "float32"}, {"name": "conv_dw_10_bn/gamma", "shape": [384], "dtype": "float32"}, {"name": "conv_dw_10_bn/beta", "shape": [384], "dtype": "float32"}, {"name": "conv_dw_10_bn/moving_mean", "shape": [384], "dtype": "float32"}, {"name": "conv_dw_10_bn/moving_variance", "shape": [384], "dtype": "float32"}, {"name": "conv_dw_11/depthwise_kernel", "shape": [3, 3, 384, 1], "dtype": "float32"}, {"name": "conv_dw_11_bn/gamma", "shape": [384], "dtype": "float32"}, {"name": "conv_dw_11_bn/beta", "shape": [384], "dtype": "float32"}, {"name": "conv_dw_11_bn/moving_mean", "shape": [384], "dtype": "float32"}, {"name": "conv_dw_11_bn/moving_variance", "shape": [384], "dtype": "float32"}, {"name": "conv_dw_12/depthwise_kernel", "shape": [3, 3, 384, 1], "dtype": "float32"}, {"name": "conv_dw_12_bn/gamma", "shape": [384], "dtype": "float32"}, {"name": "conv_dw_12_bn/beta", "shape": [384], "dtype": "float32"}, {"name": "conv_dw_12_bn/moving_mean", "shape": [384], "dtype": "float32"}, {"name": "conv_dw_12_bn/moving_variance", "shape": [384], "dtype": "float32"}, {"name": "conv_dw_13/depthwise_kernel", "shape": [3, 3, 768, 1], "dtype": "float32"}, {"name": "conv_dw_13_bn/gamma", "shape": [768], "dtype": "float32"}, {"name": "conv_dw_13_bn/beta", "shape": [768], "dtype": "float32"}, {"name": "conv_dw_13_bn/moving_mean", "shape": [768], "dtype": "float32"}, {"name": "conv_dw_13_bn/moving_variance", "shape": [768], "dtype": "float32"}, {"name": "conv_dw_1_bn/gamma", "shape": [24], "dtype": "float32"}, {"name": "conv_dw_1_bn/beta", "shape": [24], "dtype": "float32"}, {"name": "conv_dw_1_bn/moving_mean", "shape": [24], "dtype": "float32"}, {"name": "conv_dw_1_bn/moving_variance", "shape": [24], "dtype": "float32"}, {"name": "conv_dw_2/depthwise_kernel", "shape": [3, 3, 48, 1], "dtype": "float32"}, {"name": "conv_dw_2_bn/gamma", "shape": [48], "dtype": "float32"}, {"name": "conv_dw_2_bn/beta", "shape": [48], "dtype": "float32"}, {"name": "conv_dw_2_bn/moving_mean", "shape": [48], "dtype": "float32"}, {"name": "conv_dw_2_bn/moving_variance", "shape": [48], "dtype": "float32"}, {"name": "conv_dw_3/depthwise_kernel", "shape": [3, 3, 96, 1], "dtype": "float32"}, {"name": "conv_dw_3_bn/gamma", "shape": [96], "dtype": "float32"}, {"name": "conv_dw_3_bn/beta", "shape": [96], "dtype": "float32"}, {"name": "conv_dw_3_bn/moving_mean", "shape": [96], "dtype": "float32"}, {"name": "conv_dw_3_bn/moving_variance", "shape": [96], "dtype": "float32"}, {"name": "conv_dw_4/depthwise_kernel", "shape": [3, 3, 96, 1], "dtype": "float32"}, {"name": "conv_dw_4_bn/gamma", "shape": [96], "dtype": "float32"}, {"name": "conv_dw_4_bn/beta", "shape": [96], "dtype": "float32"}, {"name": "conv_dw_4_bn/moving_mean", "shape": [96], "dtype": "float32"}, {"name": "conv_dw_4_bn/moving_variance", "shape": [96], "dtype": "float32"}, {"name": "conv_dw_5/depthwise_kernel", "shape": [3, 3, 192, 1], "dtype": "float32"}, {"name": "conv_dw_5_bn/gamma", "shape": [192], "dtype": "float32"}, {"name": "conv_dw_5_bn/beta", "shape": [192], "dtype": "float32"}, {"name": "conv_dw_5_bn/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "conv_dw_5_bn/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "conv_dw_6/depthwise_kernel", "shape": [3, 3, 192, 1], "dtype": "float32"}, {"name": "conv_dw_6_bn/gamma", "shape": [192], "dtype": "float32"}, {"name": "conv_dw_6_bn/beta", "shape": [192], "dtype": "float32"}, {"name": "conv_dw_6_bn/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "conv_dw_6_bn/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "conv_dw_7/depthwise_kernel", "shape": [3, 3, 384, 1], "dtype": "float32"}, {"name": "conv_dw_7_bn/gamma", "shape": [384], "dtype": "float32"}, {"name": "conv_dw_7_bn/beta", "shape": [384], "dtype": "float32"}, {"name": "conv_dw_7_bn/moving_mean", "shape": [384], "dtype": "float32"}, {"name": "conv_dw_7_bn/moving_variance", "shape": [384], "dtype": "float32"}, {"name": "conv_dw_8/depthwise_kernel", "shape": [3, 3, 384, 1], "dtype": "float32"}, {"name": "conv_dw_8_bn/gamma", "shape": [384], "dtype": "float32"}, {"name": "conv_dw_8_bn/beta", "shape": [384], "dtype": "float32"}, {"name": "conv_dw_8_bn/moving_mean", "shape": [384], "dtype": "float32"}, {"name": "conv_dw_8_bn/moving_variance", "shape": [384], "dtype": "float32"}, {"name": "conv_dw_9/depthwise_kernel", "shape": [3, 3, 384, 1], "dtype": "float32"}, {"name": "conv_dw_9_bn/gamma", "shape": [384], "dtype": "float32"}, {"name": "conv_dw_9_bn/beta", "shape": [384], "dtype": "float32"}, {"name": "conv_dw_9_bn/moving_mean", "shape": [384], "dtype": "float32"}, {"name": "conv_dw_9_bn/moving_variance", "shape": [384], "dtype": "float32"}, {"name": "conv_pw_1/kernel", "shape": [1, 1, 24, 48], "dtype": "float32"}, {"name": "conv_pw_10/kernel", "shape": [1, 1, 384, 384], "dtype": "float32"}, {"name": "conv_pw_10_bn/gamma", "shape": [384], "dtype": "float32"}, {"name": "conv_pw_10_bn/beta", "shape": [384], "dtype": "float32"}, {"name": "conv_pw_10_bn/moving_mean", "shape": [384], "dtype": "float32"}, {"name": "conv_pw_10_bn/moving_variance", "shape": [384], "dtype": "float32"}, {"name": "conv_pw_11/kernel", "shape": [1, 1, 384, 384], "dtype": "float32"}, {"name": "conv_pw_11_bn/gamma", "shape": [384], "dtype": "float32"}, {"name": "conv_pw_11_bn/beta", "shape": [384], "dtype": "float32"}, {"name": "conv_pw_11_bn/moving_mean", "shape": [384], "dtype": "float32"}, {"name": "conv_pw_11_bn/moving_variance", "shape": [384], "dtype": "float32"}, {"name": "conv_pw_12/kernel", "shape": [1, 1, 384, 768], "dtype": "float32"}, {"name": "conv_pw_12_bn/gamma", "shape": [768], "dtype": "float32"}, {"name": "conv_pw_12_bn/beta", "shape": [768], "dtype": "float32"}, {"name": "conv_pw_12_bn/moving_mean", "shape": [768], "dtype": "float32"}, {"name": "conv_pw_12_bn/moving_variance", "shape": [768], "dtype": "float32"}, {"name": "conv_pw_13/kernel", "shape": [1, 1, 768, 768], "dtype": "float32"}, {"name": "conv_pw_13_bn/gamma", "shape": [768], "dtype": "float32"}, {"name": "conv_pw_13_bn/beta", "shape": [768], "dtype": "float32"}, {"name": "conv_pw_13_bn/moving_mean", "shape": [768], "dtype": "float32"}, {"name": "conv_pw_13_bn/moving_variance", "shape": [768], "dtype": "float32"}, {"name": "conv_pw_1_bn/gamma", "shape": [48], "dtype": "float32"}, {"name": "conv_pw_1_bn/beta", "shape": [48], "dtype": "float32"}, {"name": "conv_pw_1_bn/moving_mean", "shape": [48], "dtype": "float32"}, {"name": 